Revit 2027 API
PipingSystem.IsFlowServerMissing Method
 Indicates if any flow server which was used in the piping system is not available.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsFlowServerMissing()
Public Function IsFlowServerMissing As Boolean
public:
bool IsFlowServerMissing()
member IsFlowServerMissing : unit -> bool
Return Value
Boolean
 True if there is any flow server not available, false otherwise.
See Also
Reference
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace